// Unit 302 Data (level-independent)
import type { UnitData } from '../../app/unit/types';

export const unit302Data: UnitData = {
  unitId: 302,
  coreData: {
    forms: [
    {
      formId: 0,
      name: "ネコアイスゴースト",
      stats: [1400, 3, 8, 1100, 65, 375, 2200, 1000, 0, 320, 0, 0, 1, 54, 0, 9, 0, 0, 0, 0, 1, 0, 0, 0, 0, 75, 120, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, -1, 0, -1, 0, 0, 0, 0, 0, 1, 0, 0, -1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0],
      animLength: 71
    },
    {
      formId: 1,
      name: "ネコアイスファントム",
      stats: [2000, 3, 8, 1550, 65, 375, 2200, 1000, 0, 320, 0, 0, 1, 54, 0, 9, 0, 0, 0, 0, 1, 0, 0, 0, 0, 75, 120, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, -1, 0, -1, 0, 0, 0, 0, 0, 1, 0, 0, -1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0],
      animLength: 71
    },
    {
      formId: 2,
      name: "ネコアイスサキュバス",
      stats: [2000, 3, 8, 1800, 65, 385, 2200, 1000, 0, 320, 0, 0, 1, 54, 0, 9, 0, 0, 0, 0, 1, 0, 0, 0, 0, 75, 120, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, -1, 0, -1, 0, 0, 0, 0, 0, 1, 0, 0, -1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1],
      animLength: 71
    }
    ],
    rarity: {
      id: 4,
      name: "超激レア",
      maxLevels: [60, 70]
    },
    levelRates: [20, 20, 20, 20, 20, 20, 10, 10, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5]
  },
  auxiliaryData: {
    names: ["ネコアイスゴースト", "ネコアイスファントム", "ネコアイスサキュバス"],
    talents: {
      hasTalents: false,
      hasUltra: false,
      talentList: [
      ]
    }
  }
} as const;

export default unit302Data;


