// Unit 068 Data (level-independent)
import type { UnitData } from '../../app/unit/types';

export const unit068Data: UnitData = {
  unitId: 68,
  coreData: {
    forms: [
    {
      formId: 0,
      name: "執行者",
      stats: [400, 3, 7, 200, 80, 360, 500, 600, 0, 320, 0, 0, 1, 25, 0, 9, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 40, 120, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, -1, 0, -1, 0, 0, 0, 0, 0, 1, 0, 0, -1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0],
      animLength: 58
    },
    {
      formId: 1,
      name: "執行者999",
      stats: [700, 3, 7, 300, 80, 360, 500, 600, 0, 320, 0, 0, 1, 25, 0, 9, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 40, 120, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, -1, 0, -1, 0, 0, 0, 0, 0, 1, 0, 0, -1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0],
      animLength: 58
    },
    {
      formId: 2,
      name: "ジャッジメント",
      stats: [1000, 3, 7, 450, 51, 360, 500, 600, 0, 320, 0, 0, 1, 57, 0, 9, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 40, 120, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, -1, 0, -1, 0, 450, 0, 83, 0, 1, 1, 0, -1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0],
      animLength: 129
    }
    ],
    rarity: {
      id: 3,
      name: "激レア",
      maxLevels: [50, 70]
    },
    levelRates: [20, 20, 20, 20, 20, 20, 10, 10, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5]
  },
  auxiliaryData: {
    names: ["執行者", "執行者999", "ジャッジメント"],
    talents: {
      hasTalents: false,
      hasUltra: false,
      talentList: [
      ]
    }
  }
} as const;

export default unit068Data;


