// Unit 394 Data (level-independent)
import type { UnitData } from '../../app/unit/types';

export const unit394Data: UnitData = {
  unitId: 394,
  coreData: {
    forms: [
    {
      formId: 0,
      name: "星井スバル",
      stats: [1600, 4, 21, 900, 75, 400, 2760, 2000, 0, 320, 1, 0, 1, 31, 6, 9, 0, 0, 0, 0, 1, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 300, 300, 0, 0, 0, 0, 0, 0, 0, 0, 0, -1, 0, -1, 0, 0, 0, 0, 0, 1, 0, 0, -1, 0, 0, 0, 0, 0, 0, 0, 0, 0],
      animLength: 62
    },
    {
      formId: 1,
      name: "星井スバルCC",
      stats: [2000, 4, 21, 1200, 75, 400, 2760, 2000, 0, 320, 1, 0, 1, 31, 6, 9, 0, 0, 0, 0, 1, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 300, 300, 0, 0, 0, 0, 0, 0, 0, 0, 0, -1, 0, -1, 0, 0, 0, 0, 0, 1, 0, 0, -1, 0, 0, 0, 0, 0, 0, 0, 0, 0],
      animLength: 62
    },
    {
      formId: 2,
      name: "暗黒スバルCC",
      stats: [2800, 4, 21, 1800, 75, 425, 2760, 2000, 0, 320, 1, 0, 1, 51, 6, 9, 0, 0, 0, 0, 1, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 300, 325, 0, 0, 0, 0, 0, 0, 0, 0, 0, -1, 0, -1, 0, 0, 0, 0, 0, 1, 0, 0, -1, 0, 0, 0, 0, 0, 0, 0, 0, 0],
      animLength: 82
    }
    ],
    rarity: {
      id: 4,
      name: "超激レア",
      maxLevels: [60, 70]
    },
    levelRates: [20, 20, 20, 20, 20, 20, 10, 10, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5]
  },
  auxiliaryData: {
    names: ["星井スバル", "星井スバルCC", "暗黒スバルCC"],
    talents: {
      hasTalents: false,
      hasUltra: false,
      talentList: [
      ]
    }
  }
} as const;

export default unit394Data;


