// Unit 617 Data (level-independent)
import type { UnitData } from '../../app/unit/types';

export const unit617Data: UnitData = {
  unitId: 617,
  coreData: {
    forms: [
    {
      formId: 0,
      name: "召喚少年サトル",
      stats: [1850, 3, 20, 1260, 76, 470, 2400, 1400, 0, 320, 0, 0, 1, 110, 5, 9, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 100, 120, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 370, 400, 0, 0, 0, 0, 0, 0, 0, 0, 0, -1, 0, -1, 0, 0, 0, 0, 0, 1, 0, 0, -1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0, 0, 0, 20, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0],
      animLength: 166
    },
    {
      formId: 1,
      name: "悪魔召喚サトル",
      stats: [2150, 3, 20, 1660, 76, 470, 2400, 1400, 0, 320, 0, 0, 1, 110, 5, 9, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 100, 180, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 370, 400, 0, 0, 0, 0, 0, 0, 0, 0, 0, -1, 0, -1, 0, 0, 0, 0, 0, 1, 0, 0, -1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0, 0, 0, 20, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0],
      animLength: 166
    },
    {
      formId: 2,
      name: "デビルハンターサトル",
      stats: [2450, 3, 20, 1660, 76, 470, 2400, 1400, 0, 320, 0, 0, 1, 110, 5, 9, 0, 0, 0, 0, 0, 0, 0, 0, 100, 0, 0, 100, 180, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 370, 400, 0, 0, 0, 0, 0, 0, 0, 0, 0, -1, 0, -1, 0, 0, 0, 0, 0, 1, 0, 0, -1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0, 0, 0, 50, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0],
      animLength: 169
    }
    ],
    rarity: {
      id: 4,
      name: "超激レア",
      maxLevels: [60, 70]
    },
    levelRates: [20, 20, 20, 20, 20, 20, 10, 10, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5]
  },
  auxiliaryData: {
    names: ["召喚少年サトル", "悪魔召喚サトル", "デビルハンターサトル"],
    talents: {
      hasTalents: true,
      hasUltra: false,
      talentList: [
      {
        id: 11,
        name: "生き残る",
        type: "normal" as const,
        data: [11, 10, 28, 100, 0, 0, 0, 0, 0, 0, 11, 7, -1, 0],
        npCost: 235,
        isTotal: true
      },
      {
        id: 29,
        name: "古代の呪い無効",
        type: "normal" as const,
        data: [29, 0, 0, 0, 0, 0, 0, 0, 0, 0, 25, 9, -1, 0],
        npCost: 100,
        isTotal: false
      },
      {
        id: 47,
        name: "ふっとばし無効",
        type: "normal" as const,
        data: [47, 0, 0, 0, 0, 0, 0, 0, 0, 0, 56, 9, -1, 0],
        npCost: 100,
        isTotal: false
      },
      {
        id: 32,
        name: "基本体力アップ",
        type: "normal" as const,
        data: [32, 10, 2, 20, 0, 0, 0, 0, 0, 0, 27, 8, -1, 0],
        npCost: 175,
        isTotal: true
      },
      {
        id: 31,
        name: "基本攻撃力アップ",
        type: "normal" as const,
        data: [31, 10, 2, 20, 0, 0, 0, 0, 0, 0, 28, 8, -1, 0],
        npCost: 175,
        isTotal: true
      }
      ]
    }
  }
} as const;

export default unit617Data;


