// Unit 390 Data (level-independent)
import type { UnitData } from '../../app/unit/types';

export const unit390Data: UnitData = {
  unitId: 390,
  coreData: {
    forms: [
    {
      formId: 0,
      name: "早川あおい",
      stats: [960, 2, 19, 480, 46, 200, 880, 480, 0, 320, 0, 0, 1, 20, 6, 9, 0, 0, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, -1, 0, -1, 0, 0, 0, 0, 0, 1, 0, 0, -1, 0, 0, 0, 0, 0, 0, 0, 0, 0],
      animLength: 71
    },
    {
      formId: 1,
      name: "早川あおいCC",
      stats: [1280, 2, 19, 640, 46, 200, 880, 480, 0, 320, 0, 0, 1, 20, 6, 9, 0, 0, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, -1, 0, -1, 0, 0, 0, 0, 0, 1, 0, 0, -1, 0, 0, 0, 0, 0, 0, 0, 0, 0],
      animLength: 71
    },
    {
      formId: 2,
      name: "野球マン１号CC",
      stats: [1280, 2, 19, 640, 67, 275, 880, 480, 0, 320, 0, 0, 1, 28, 6, 9, 0, 0, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 200, 200, 0, 0, 0, 0, 0, 0, 0, 0, 0, -1, 0, -1, 0, 0, 0, 0, 0, 1, 0, 0, -1, 0, 0, 0, 0, 0, 0, 0, 0, 0],
      animLength: 62
    }
    ],
    rarity: {
      id: 3,
      name: "激レア",
      maxLevels: [50, 70]
    },
    levelRates: [20, 20, 20, 20, 20, 20, 10, 10, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5]
  },
  auxiliaryData: {
    names: ["早川あおい", "早川あおいCC", "野球マン１号CC"],
    talents: {
      hasTalents: false,
      hasUltra: false,
      talentList: [
      ]
    }
  }
} as const;

export default unit390Data;


