// Unit 366 Data (level-independent)
import type { UnitData } from '../../app/unit/types';

export const unit366Data: UnitData = {
  unitId: 366,
  coreData: {
    forms: [
    {
      formId: 0,
      name: "ランサー",
      stats: [1900, 4, 13, 900, 46, 480, 2900, 2050, 0, 320, 0, 0, 1, 44, 0, 9, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, -1, 0, -1, 0, 0, 0, 0, 0, 1, 0, 0, -1, 0, 0, 0, 100, 0, 0, 0, 0, 0],
      animLength: 76
    },
    {
      formId: 1,
      name: "ランサーCC",
      stats: [2900, 4, 13, 1350, 46, 480, 2900, 2050, 0, 320, 0, 0, 1, 44, 0, 9, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, -1, 0, -1, 0, 0, 0, 0, 0, 1, 0, 0, -1, 0, 0, 0, 100, 0, 0, 0, 0, 0],
      animLength: 76
    },
    {
      formId: 2,
      name: "Form 3",
      stats: [2900, 4, 13, 1350, 46, 480, 2900, 2050, 0, 320, 0, 0, 1, 44, 0, 9, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, -1, 0, -1, 0, 0, 0, 0, 0, 1, 0, 0, -1, 0, 0, 0, 100, 0, 0, 0, 0, 0],
      animLength: 30
    }
    ],
    rarity: {
      id: 4,
      name: "超激レア",
      maxLevels: [60, 70]
    },
    levelRates: [20, 20, 20, 20, 20, 20, 10, 10, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5]
  },
  auxiliaryData: {
    names: ["ランサー", "ランサーCC"],
    talents: {
      hasTalents: false,
      hasUltra: false,
      talentList: [
      ]
    }
  }
} as const;

export default unit366Data;


