// Unit 078 Data (level-independent)
import type { UnitData } from '../../app/unit/types';

export const unit078Data: UnitData = {
  unitId: 78,
  coreData: {
    forms: [
    {
      formId: 0,
      name: "ネコと宇宙",
      stats: [180, 3, 10, 71, 15, 340, 420, 300, 0, 320, 0, 0, 0, 30, 0, 9, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 4, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, -1, 0, -1, 0, 0, 0, 0, 0, 1, 0, 0, -1, 0, 0, 0, 30, 0, 0, 0, 0, 0, 0, 0, 0, 0],
      animLength: 61
    },
    {
      formId: 1,
      name: "ニャア少佐",
      stats: [240, 3, 10, 81, 15, 340, 420, 300, 0, 320, 0, 0, 0, 30, 0, 9, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 4, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, -1, 0, -1, 0, 0, 0, 0, 0, 1, 0, 0, -1, 0, 0, 0, 30, 0, 0, 0, 0, 0, 0, 0, 0, 0],
      animLength: 61
    },
    {
      formId: 2,
      name: "駆動戦士ネコ",
      stats: [600, 3, 10, 81, 15, 340, 420, 300, 0, 320, 0, 0, 0, 30, 0, 9, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 8, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, -1, 0, -1, 0, 0, 0, 0, 0, 1, 0, 0, -1, 0, 0, 0, 50, 0, 0, 0, 0, 0, 0, 0, 0, 0],
      animLength: 61
    }
    ],
    rarity: {
      id: 2,
      name: "レア",
      maxLevels: [50, 0]
    },
    levelRates: [20, 20, 20, 20, 20, 20, 20, 10, 10, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5]
  },
  auxiliaryData: {
    names: ["ネコと宇宙", "ニャア少佐", "駆動戦士ネコ"],
    talents: {
      hasTalents: false,
      hasUltra: false,
      talentList: [
      ]
    }
  }
} as const;

export default unit078Data;


