// Unit 559 Data (level-independent)
import type { UnitData } from '../../app/unit/types';

export const unit559Data: UnitData = {
  unitId: 559,
  coreData: {
    forms: [
    {
      formId: 0,
      name: "地獄警官エマ",
      stats: [15000, 10, 30, 400, 0, 200, 2900, 2000, 0, 320, 1, 0, 1, 48, 0, 9, 1, 1, 1, 1, 1, 1, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 20, 60, 50, 0, 0, 0, 0, 350, -950, 0, 1, 0, 0, 0, 0, 0, 0, 0, -1, 0, -1, 0, 400, 400, 73, 98, 1, 1, 1, -1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0],
      animLength: 159
    },
    {
      formId: 1,
      name: "地獄軍曹エマ",
      stats: [15000, 10, 30, 400, 0, 200, 2900, 2000, 0, 320, 1, 0, 1, 48, 0, 9, 1, 1, 1, 1, 1, 1, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 20, 60, 50, 0, 0, 0, 0, 350, -950, 0, 1, 0, 0, 0, 0, 0, 0, 0, -1, 0, -1, 0, 400, 400, 73, 98, 1, 1, 1, -1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0],
      animLength: 159
    },
    {
      formId: 2,
      name: "閻魔総長エマ",
      stats: [20000, 10, 30, 400, 0, 200, 2900, 2000, 0, 320, 1, 0, 1, 48, 0, 9, 1, 1, 1, 1, 1, 1, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 40, 60, 50, 0, 0, 0, 0, 350, -950, 0, 1, 0, 1, 0, 0, 0, 0, 0, -1, 0, -1, 0, 400, 400, 73, 98, 1, 1, 1, -1, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0],
      animLength: 159
    }
    ],
    rarity: {
      id: 4,
      name: "超激レア",
      maxLevels: [60, 70]
    },
    levelRates: [20, 20, 20, 20, 20, 20, 10, 10, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5]
  },
  auxiliaryData: {
    names: ["地獄警官エマ", "地獄軍曹エマ", "閻魔総長エマ"],
    talents: {
      hasTalents: true,
      hasUltra: false,
      talentList: [
      {
        id: 17,
        name: "波動攻撃",
        type: "normal" as const,
        data: [17, 10, 4, 40, 3, 3, 0, 0, 0, 0, 17, 7, -1, 0],
        npCost: 235,
        isTotal: true
      },
      {
        id: 1,
        name: "攻撃力ダウン",
        type: "normal" as const,
        data: [1, 10, 0, 0, 5, 50, 0, 0, 0, 0, 42, 8, -1, 0],
        npCost: 175,
        isTotal: true
      },
      {
        id: 29,
        name: "古代の呪い無効",
        type: "normal" as const,
        data: [29, 0, 0, 0, 0, 0, 0, 0, 0, 0, 25, 9, -1, 0],
        npCost: 100,
        isTotal: false
      },
      {
        id: 32,
        name: "基本体力アップ",
        type: "normal" as const,
        data: [32, 10, 2, 20, 0, 0, 0, 0, 0, 0, 27, 8, -1, 0],
        npCost: 175,
        isTotal: true
      },
      {
        id: 31,
        name: "基本攻撃力アップ",
        type: "normal" as const,
        data: [31, 10, 2, 20, 0, 0, 0, 0, 0, 0, 28, 8, -1, 0],
        npCost: 175,
        isTotal: true
      }
      ]
    }
  }
} as const;

export default unit559Data;


