// Unit 508 Data (level-independent)
import type { UnitData } from '../../app/unit/types';

export const unit508Data: UnitData = {
  unitId: 508,
  coreData: {
    forms: [
    {
      formId: 0,
      name: "ネコリュウ",
      stats: [490, 3, 10, 40, 15, 350, 450, 270, 0, 320, 0, 0, 0, 15, 0, 9, 0, 1, 0, 0, 0, 0, 0, 0, 0, 20, 60, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, -1, 0, -1, 0, 0, 0, 0, 0, 1, 0, 0, -1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0],
      animLength: 38
    },
    {
      formId: 1,
      name: "ネコリュウCC",
      stats: [490, 3, 10, 40, 15, 350, 450, 270, 0, 320, 0, 0, 0, 15, 0, 9, 0, 1, 0, 0, 0, 0, 0, 0, 0, 20, 60, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, -1, 0, -1, 0, 0, 0, 0, 0, 1, 0, 0, -1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0],
      animLength: 38
    },
    {
      formId: 2,
      name: "Form 3",
      stats: [490, 3, 10, 40, 15, 350, 450, 270, 0, 320, 0, 0, 0, 15, 0, 9, 0, 1, 0, 0, 0, 0, 0, 0, 0, 20, 60, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, -1, 0, -1, 0, 0, 0, 0, 0, 1, 0, 0, -1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0],
      animLength: 30
    }
    ],
    rarity: {
      id: 2,
      name: "レア",
      maxLevels: [50, 0]
    },
    levelRates: [20, 20, 20, 20, 20, 20, 20, 10, 10, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5]
  },
  auxiliaryData: {
    names: ["ネコリュウ", "ネコリュウCC"],
    talents: {
      hasTalents: false,
      hasUltra: false,
      talentList: [
      ]
    }
  }
} as const;

export default unit508Data;


