// Unit 474 Data (level-independent)
import type { UnitData } from '../../app/unit/types';

export const unit474Data: UnitData = {
  unitId: 474,
  coreData: {
    forms: [
    {
      formId: 0,
      name: "十字架天使",
      stats: [240, 3, 8, 45, 92, 400, 400, 500, 0, 320, 1, 0, 0, 37, 6, 9, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 50, 200, 50, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, -1, 0, -1, 0, 0, 0, 0, 0, 1, 0, 0, -1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0],
      animLength: 78
    },
    {
      formId: 1,
      name: "クロスエンジェル",
      stats: [300, 3, 8, 50, 92, 400, 400, 500, 0, 320, 1, 0, 0, 37, 6, 9, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 50, 200, 50, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, -1, 0, -1, 0, 0, 0, 0, 0, 1, 0, 0, -1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0],
      animLength: 78
    },
    {
      formId: 2,
      name: "ストライク天使",
      stats: [360, 3, 8, 55, 92, 400, 400, 500, 0, 320, 1, 0, 0, 37, 6, 9, 0, 1, 0, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 50, 200, 50, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0, 0, -1, 0, -1, 0, 0, 0, 0, 0, 1, 0, 0, -1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0],
      animLength: 78
    }
    ],
    rarity: {
      id: 1,
      name: "EX",
      maxLevels: [50, 30]
    },
    levelRates: [20, 20, 20, 20, 20, 20, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10]
  },
  auxiliaryData: {
    names: ["十字架天使", "クロスエンジェル", "ストライク天使"],
    talents: {
      hasTalents: false,
      hasUltra: false,
      talentList: [
      ]
    }
  }
} as const;

export default unit474Data;


