// Unit 060 Data (level-independent)
import type { UnitData } from '../../app/unit/types';

export const unit060Data: UnitData = {
  unitId: 60,
  coreData: {
    forms: [
    {
      formId: 0,
      name: "ネコブ・ロンズ",
      stats: [600, 2, 8, 98, 20, 160, 420, 283, 0, 320, 0, 0, 1, 12, 0, 9, 0, 0, 1, 0, 0, 0, 0, 0, 20, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, -1, 0, -1, 0, 0, 0, 0, 0, 1, 0, 0, -1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0],
      animLength: 50
    },
    {
      formId: 1,
      name: "芸術のネコスタチュ",
      stats: [900, 2, 8, 128, 20, 160, 420, 283, 0, 320, 0, 0, 1, 12, 0, 9, 0, 0, 1, 0, 0, 0, 0, 0, 20, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, -1, 0, -1, 0, 0, 0, 0, 0, 1, 0, 0, -1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0],
      animLength: 50
    },
    {
      formId: 2,
      name: "ネコクイズ王",
      stats: [900, 2, 8, 188, 0, 190, 420, 283, 0, 320, 0, 0, 1, 27, 0, 9, 0, 0, 1, 0, 0, 0, 0, 0, 30, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, -1, 0, -1, 0, 0, 0, 0, 0, 1, 0, 0, -1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0],
      animLength: 142
    }
    ],
    rarity: {
      id: 2,
      name: "レア",
      maxLevels: [50, 0]
    },
    levelRates: [20, 20, 20, 20, 20, 20, 20, 10, 10, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5]
  },
  auxiliaryData: {
    names: ["ネコブ・ロンズ", "芸術のネコスタチュ", "ネコクイズ王"],
    talents: {
      hasTalents: false,
      hasUltra: false,
      talentList: [
      ]
    }
  }
} as const;

export default unit060Data;


