// Unit 410 Data (level-independent)
import type { UnitData } from '../../app/unit/types';

export const unit410Data: UnitData = {
  unitId: 410,
  coreData: {
    forms: [
    {
      formId: 0,
      name: "ちびアスカ",
      stats: [1560, 2, 10, 780, 53, 315, 760, 425, 0, 320, 1, 0, 1, 39, 0, 9, 0, 0, 0, 0, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0, 0, 0, 0, -1, 0, -1, 0, 0, 0, 0, 0, 1, 0, 0, -1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0],
      animLength: 99
    },
    {
      formId: 1,
      name: "プラグスーツのちびアスカ",
      stats: [1560, 2, 10, 780, 53, 315, 760, 425, 0, 320, 1, 0, 1, 39, 0, 9, 0, 0, 0, 0, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0, 0, 0, 0, -1, 0, -1, 0, 0, 0, 0, 0, 1, 0, 0, -1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0],
      animLength: 99
    },
    {
      formId: 2,
      name: "眼帯のちびアスカ",
      stats: [1720, 2, 10, 880, 53, 315, 760, 425, 0, 320, 1, 0, 1, 39, 0, 9, 0, 0, 0, 0, 0, 0, 0, 1, 40, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0, 0, 0, 0, -1, 0, -1, 0, 0, 0, 0, 0, 1, 0, 0, -1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0],
      animLength: 99
    }
    ],
    rarity: {
      id: 3,
      name: "激レア",
      maxLevels: [50, 70]
    },
    levelRates: [20, 20, 20, 20, 20, 20, 10, 10, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5]
  },
  auxiliaryData: {
    names: ["ちびアスカ", "プラグスーツのちびアスカ", "眼帯のちびアスカ"],
    talents: {
      hasTalents: false,
      hasUltra: false,
      talentList: [
      ]
    }
  }
} as const;

export default unit410Data;


