// Unit 506 Data (level-independent)
import type { UnitData } from '../../app/unit/types';

export const unit506Data: UnitData = {
  unitId: 506,
  coreData: {
    forms: [
    {
      formId: 0,
      name: "アイウォルツ",
      stats: [2600, 3, 12, 1100, 55, 360, 2500, 1650, 0, 320, 0, 0, 1, 32, 0, 9, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 100, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, -1, 0, -1, 0, 0, 0, 0, 0, 1, 0, 0, -1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 15, 200, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0],
      animLength: 62
    },
    {
      formId: 1,
      name: "アイウォルツCC",
      stats: [3600, 3, 12, 1500, 55, 360, 2500, 1650, 0, 320, 0, 0, 1, 32, 0, 9, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 100, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, -1, 0, -1, 0, 0, 0, 0, 0, 1, 0, 0, -1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 15, 200, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0],
      animLength: 62
    },
    {
      formId: 2,
      name: "無名のアイウォルツCC",
      stats: [3600, 3, 12, 1500, 54, 360, 2500, 1650, 0, 320, 0, 0, 1, 35, 0, 9, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 100, 2, 0, 0, 0, 0, 0, 100, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, -1, 0, -1, 0, 0, 0, 0, 0, 1, 0, 0, -1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 15, 200, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0],
      animLength: 71
    }
    ],
    rarity: {
      id: 4,
      name: "超激レア",
      maxLevels: [60, 70]
    },
    levelRates: [20, 20, 20, 20, 20, 20, 10, 10, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5]
  },
  auxiliaryData: {
    names: ["アイウォルツ", "アイウォルツCC", "無名のアイウォルツCC"],
    talents: {
      hasTalents: true,
      hasUltra: false,
      talentList: [
      {
        id: 50,
        name: "渾身の一撃",
        type: "normal" as const,
        data: [50, 10, 1, 10, 0, 0, 0, 0, 0, 0, 61, 8, -1, 0],
        npCost: 175,
        isTotal: true
      },
      {
        id: 44,
        name: "攻撃力ダウン無効",
        type: "normal" as const,
        data: [44, 0, 0, 0, 0, 0, 0, 0, 0, 0, 53, 9, -1, 0],
        npCost: 100,
        isTotal: false
      },
      {
        id: 47,
        name: "ふっとばし無効",
        type: "normal" as const,
        data: [47, 0, 0, 0, 0, 0, 0, 0, 0, 0, 56, 9, -1, 0],
        npCost: 100,
        isTotal: false
      },
      {
        id: 20,
        name: "動きを遅くする耐性",
        type: "normal" as const,
        data: [20, 10, 16, 70, 0, 0, 0, 0, 0, 0, 20, 8, -1, 0],
        npCost: 175,
        isTotal: true
      },
      {
        id: 32,
        name: "基本体力アップ",
        type: "normal" as const,
        data: [32, 10, 2, 20, 0, 0, 0, 0, 0, 0, 27, 8, -1, 0],
        npCost: 175,
        isTotal: true
      }
      ]
    }
  }
} as const;

export default unit506Data;


