// Unit 455 Data (level-independent)
import type { UnitData } from '../../app/unit/types';

export const unit455Data: UnitData = {
  unitId: 455,
  coreData: {
    forms: [
    {
      formId: 0,
      name: "ワンダー・モモコ",
      stats: [4000, 2, 13, 300, 0, 375, 3000, 2000, 0, 320, 1, 0, 1, 28, 8, 9, 0, 1, 0, 0, 1, 0, 0, 0, 0, 100, 60, 0, 0, 0, 0, 0, 0, 0, 0, 100, 8, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, -1, 0, -1, 0, 600, 2700, 55, 100, 1, 0, 0, -1, 10, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0],
      animLength: 201
    },
    {
      formId: 1,
      name: "キューティー・モモコ",
      stats: [4000, 2, 13, 300, 0, 375, 3000, 2000, 0, 320, 1, 0, 1, 28, 8, 9, 0, 1, 0, 0, 1, 0, 0, 0, 0, 100, 60, 0, 0, 0, 0, 0, 0, 0, 0, 100, 8, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, -1, 0, -1, 0, 600, 2700, 55, 100, 1, 0, 0, -1, 10, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0],
      animLength: 201
    },
    {
      formId: 2,
      name: "Form 3",
      stats: [4000, 2, 13, 300, 0, 375, 3000, 2000, 0, 320, 1, 0, 1, 28, 8, 9, 0, 1, 0, 0, 1, 0, 0, 0, 0, 100, 60, 0, 0, 0, 0, 0, 0, 0, 0, 100, 8, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, -1, 0, -1, 0, 600, 2700, 55, 100, 1, 0, 0, -1, 10, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0],
      animLength: 30
    }
    ],
    rarity: {
      id: 5,
      name: "伝説レア",
      maxLevels: [50, 9]
    },
    levelRates: [20, 20, 20, 20, 20, 20, 10, 10, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5]
  },
  auxiliaryData: {
    names: ["ワンダー・モモコ", "キューティー・モモコ"],
    talents: {
      hasTalents: false,
      hasUltra: false,
      talentList: [
      ]
    }
  }
} as const;

export default unit455Data;


