// Unit 254 Data (level-independent)
import type { UnitData } from '../../app/unit/types';

export const unit254Data: UnitData = {
  unitId: 254,
  coreData: {
    forms: [
    {
      formId: 0,
      name: "プリティキャット",
      stats: [580, 4, 9, 150, 0, 180, 660, 220, 0, 320, 1, 0, 0, 22, 0, 9, 1, 1, 0, 1, 1, 1, 1, 0, 0, 5, 60, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, -1, 0, -1, 0, 0, 0, 0, 0, 1, 0, 0, -1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1],
      animLength: 47
    },
    {
      formId: 1,
      name: "ラブリープリティキャット",
      stats: [580, 4, 9, 150, 0, 180, 660, 220, 0, 320, 1, 0, 0, 22, 0, 9, 1, 1, 0, 1, 1, 1, 1, 0, 0, 5, 60, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, -1, 0, -1, 0, 0, 0, 0, 0, 1, 0, 0, -1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1],
      animLength: 47
    },
    {
      formId: 2,
      name: "サイバープリティキャット",
      stats: [580, 4, 9, 150, 0, 180, 660, 220, 0, 320, 1, 0, 0, 22, 0, 9, 1, 1, 0, 1, 1, 1, 1, 0, 0, 10, 60, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, -1, 0, -1, 0, 0, 0, 0, 0, 1, 0, 0, -1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1],
      animLength: 47
    }
    ],
    rarity: {
      id: 2,
      name: "レア",
      maxLevels: [50, 0]
    },
    levelRates: [20, 20, 20, 20, 20, 20, 20, 10, 10, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5]
  },
  auxiliaryData: {
    names: ["プリティキャット", "ラブリープリティキャット", "サイバープリティキャット"],
    talents: {
      hasTalents: false,
      hasUltra: false,
      talentList: [
      ]
    }
  }
} as const;

export default unit254Data;


