// Unit 482 Data (level-independent)
import type { UnitData } from '../../app/unit/types';

export const unit482Data: UnitData = {
  unitId: 482,
  coreData: {
    forms: [
    {
      formId: 0,
      name: "幸せを願った少年ソウマ",
      stats: [1600, 6, 8, 2250, 109, 440, 2800, 1800, 0, 320, 0, 0, 1, 43, 0, 9, 0, 0, 0, 0, 1, 1, 0, 0, 0, 0, 0, 50, 150, 0, 0, 0, 0, 0, 0, 0, 0, 50, 150, 50, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, -1, 0, -1, 0, 0, 0, 0, 0, 1, 0, 0, -1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0],
      animLength: 101
    },
    {
      formId: 1,
      name: "幸せを願った少年ソウマ＆ネコ",
      stats: [2000, 6, 8, 2750, 109, 440, 2800, 1800, 0, 320, 0, 0, 1, 43, 0, 9, 0, 0, 0, 0, 1, 1, 0, 0, 0, 0, 0, 50, 150, 0, 0, 0, 0, 0, 0, 0, 0, 50, 150, 50, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, -1, 0, -1, 0, 0, 0, 0, 0, 1, 0, 0, -1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0],
      animLength: 101
    },
    {
      formId: 2,
      name: "幸せを願ったネコ耳ソウマ",
      stats: [2000, 6, 8, 2750, 109, 440, 2800, 1800, 0, 320, 0, 0, 1, 43, 0, 9, 1, 0, 0, 0, 1, 1, 0, 0, 0, 0, 0, 100, 150, 0, 0, 0, 0, 0, 0, 0, 0, 100, 150, 50, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, -1, 0, -1, 0, 0, 0, 0, 0, 1, 0, 0, -1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0],
      animLength: 101
    }
    ],
    rarity: {
      id: 4,
      name: "超激レア",
      maxLevels: [60, 70]
    },
    levelRates: [20, 20, 20, 20, 20, 20, 10, 10, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5]
  },
  auxiliaryData: {
    names: ["幸せを願った少年ソウマ", "幸せを願った少年ソウマ＆ネコ", "幸せを願ったネコ耳ソウマ"],
    talents: {
      hasTalents: true,
      hasUltra: false,
      talentList: [
      {
        id: 60,
        name: "呪い",
        type: "normal" as const,
        data: [60, 10, 100, 100, 10, 100, 0, 0, 0, 0, 80, 7, -1, 0],
        npCost: 235,
        isTotal: true
      },
      {
        id: 51,
        name: "攻撃無効",
        type: "normal" as const,
        data: [51, 10, 20, 20, 24, 60, 0, 0, 0, 0, 60, 7, -1, 0],
        npCost: 235,
        isTotal: true
      },
      {
        id: 29,
        name: "古代の呪い無効",
        type: "normal" as const,
        data: [29, 0, 0, 0, 0, 0, 0, 0, 0, 0, 25, 9, -1, 0],
        npCost: 100,
        isTotal: false
      },
      {
        id: 32,
        name: "基本体力アップ",
        type: "normal" as const,
        data: [32, 10, 2, 20, 0, 0, 0, 0, 0, 0, 27, 8, -1, 0],
        npCost: 175,
        isTotal: true
      },
      {
        id: 31,
        name: "基本攻撃力アップ",
        type: "normal" as const,
        data: [31, 10, 2, 20, 0, 0, 0, 0, 0, 0, 28, 8, -1, 0],
        npCost: 175,
        isTotal: true
      }
      ]
    }
  }
} as const;

export default unit482Data;


