export const DEFAULTS = {
  seed: "31611181",
  gatyasets: [
    // 452, // エアバスターズ
    // 523, // 波動バスターズ
    // 696, // レッドバスターズ
    // 772, // 超生命体バスターズ
    // 785, // バレンタイン
    // 861, // 女王祭
    // 906, // メタルバスターズ
    // 936, // ウルトラ4
    // 937, // ミラクル4
    // 938, // エクセレント4
    // 939, // バスターズ祭 
    // 942, // ダイナマイツ
    943, // バサラーズ
    // 944, // ギャルズ
    // 945, // エンペラーズ
    // 946, // ウルトラソウルズ
    // 947, // ダークヒーローズ
    // 948, // ギガントゼウス
    // 949, // アイアンウォーズ
    // 950, // ギャルモン
    // 951, // ピクシーズ
    // 962, // ルガ族 
    963, // 超ネコ
    // 964, // 極ネコ
    // 965, // プラチケ
    // 966, // レジェチケ
    // 967, // 1億DL記念選抜
    // 968, // ホワイトデー
    // 969, // 極ネコ祭
    // 970, // プラチケ
    // 971, // レジェチケ
    // 972, // 超極ネコ
    // 973, // 超国王祭
    // 974, // アウトレット
    // 975, // 超選抜祭
    // 976, // 極選抜祭
    // 977, // バキコラボ
    // 979, // アイアンウォーズ
    985, // ソニックコラボ
    // 986, // ルガ族
  ].join(","),
  rolls: "200",
  lastCat: "",
  selected: "",
};

export const MISTIC_CATS = [
  '幼獣ガオ',               // 269
  '巫女姫ミタマ',           // 318
  '黒獣ガオウ',             // 333
  '黒無垢のミタマ',         // 378
  '幼傑ダルターニャ',       // 380
  '影傑ダークダルターニャ', // 441
  '厄災の子キャスリィ',     // 529
  '禍根の魔女キャスリィ',   // 543
  '幼獣ガル',               // 585
  '黒獣ガルディアン',       // 609
  '踊り子イズ',             // 641
  '悲嘆の踊り子イズ',       // 657
  '運命の子フォノ',         // 690
  '非命の王フォノウ',       // 705
  '幼天女ルーナ',           // 779
  '冥護の天女ルナーシャ',   // 787
];

export const LIMITED_CATS = [
  'こねこ',                 // 783
  'ネコ王女',               // 612
  '猫飯拳パイパイ',         // 283
  '閃雷機兵レイ',           // 286
  '風隼さくら',             // 397
  '地獄警官エマ',           // 559
  '光の女神シリウス',       // 686
];

export const PICKUP_UBER_CATS = [
  '鬼にゃんま',             //  44
  '真田幸村',               //  71
  '呪術師デスピエロ',       // 226
];
