export const DEFAULTS = {
  seed: "603670555",
  gatyasets: [
    785,
    945,
    941,
    967,
    950,
    954,
    953,
  ].join(","),
  rolls: "50",
  lastCat: "",
  // selected: "",
};

export const MISTIC_CATS = [
  '幼獣ガオ',               // 269
  '巫女姫ミタマ',           // 318
  '黒獣ガオウ',             // 333
  '黒無垢のミタマ',         // 378
  '幼傑ダルターニャ',       // 380
  '影傑ダークダルターニャ', // 441
  '厄災の子キャスリィ',     // 529
  '禍根の魔女キャスリィ',   // 543
  '幼獣ガル',               // 585
  '黒獣ガルディアン',       // 609
  '踊り子イズ',             // 641
  '悲嘆の踊り子イズ',       // 657
  '運命の子フォノ',         // 690
  '非命の王フォノウ',       // 705
  '幼天女ルーナ',           // 779
];

export const LIMITED_CATS = [
  'ネコ王女',               // 612
  '猫飯拳パイパイ',         // 283
  '閃雷機兵レイ',           // 286
  '風隼さくら',             // 397
  '地獄警官エマ',           // 559
  '光の女神シリウス',       // 686
];

export const PICKUP_UBER_CATS = [
  '鬼にゃんま',             //  44
  '真田幸村',               //  71
];
