export const DEFAULTS = {
  seed: "3007321693",
  gatyasets: [
    // 452, // 浮バス
    // 523, // 波バス
    // 696, // 赤バス
    // 772, // 超バス
    // 785, // バレンタイン
    // 861, // 女王祭
    // 906, // メタバス
    // 936, // ウルトラ4
    // 937, // ミラクル4
    // 938, // エクセレ4
    // 939, // バス祭 
    942, // ダイナマ
    // 943, // バサラ
    // 944, // ギャルズ
    // 945, // ペラーズ
    // 946, // ソウルズ
    // 947, // ヒーローズ
    // 948, // ギガンゼ
    // 949, // アイアン
    950, // ギャルモン
    // 951, // ピクシ
    // 962, // ルガ族 
    // 963, // 超ネコ祭
    // 964, // 極ネコ
    // 965, // プラチケ
    // 966, // レジェチケ
    // 967, // 1億選抜
    // 968, // ホワイトデー
    // 969, // 極ネコ祭
    // 970, // プラチケ
    // 971, // レジェチケ
    // 972, // 超極ネコ祭
    // 973, // 超国王祭
    // 974, // アウトレット
    // 975, // 超選抜祭
    // 976, // 極選抜祭
    // 977, // バキコラボ
    // 979, // アイアン
    // 981, // 超ネコ祭
    // 982, // 極ネコ祭
    // 983, // プラチケ
    // 984, // レジェチケ
    // 985, // ソニックコラボ
    // 986, // ルガ族
    // 990, // 超選抜祭
    // 992, // ギガンゼ
    // 993, // 超ネコ祭
    994, // 極ネコ祭
    // 995, // プラチケ
    // 996, // レジェチケ
    997, // サマガ青
    // 998, // エヴァ新世紀
    // 999, // エヴァ新劇場版
    //1000, // マンボウ
    1005, // ピクシーズ
    1006, // 超ネコ祭
    // 1007, // 極ネコ祭
    1010, // サマガ赤
    1011, // 1.1億DL記念
    1012, // 超王国祭
  ].join(","),
  rolls: "100",
  lastCat: "",
  selected: "",
};

export const MISTIC_CATS = [
  '幼獣ガオ',               // 269
  '巫女姫ミタマ',           // 318
  '黒獣ガオウ',             // 333
  '黒無垢のミタマ',         // 378
  '幼傑ダルターニャ',       // 380
  '影傑ダークダルターニャ', // 441
  '厄災の子キャスリィ',     // 529
  '禍根の魔女キャスリィ',   // 543
  '幼獣ガル',               // 585
  '黒獣ガルディアン',       // 609
  '踊り子イズ',             // 641
  '悲嘆の踊り子イズ',       // 657
  '運命の子フォノ',         // 690
  '非命の王フォノウ',       // 705
  '幼天女ルーナ',           // 779
  '冥護の天女ルナーシャ',   // 787
];

export const LIMITED_CATS = [
  'こねこ',                 // 783
  'ネコ王女',               // 612
  '猫飯拳パイパイ',         // 283
  '閃雷機兵レイ',           // 286
  '風隼さくら',             // 397
  '地獄警官エマ',           // 559
  '光の女神シリウス',       // 686
];

export const PICKUP_UBER_CATS = [
  '鬼にゃんま',             //  44
  '真田幸村',               //  71
  '呪術師デスピエロ',       // 226
];
