import { GatyaSet } from "@/data/gatyasets";

export const Set1004: GatyaSet = {
  name: "エレメントピクシーズ（汎用）",
  guaranteed: 10,
  shortName: "1004",
  gatyasetId: 1004,
  rateCumSum: [0, 6970, 9470, 9970, 10000],
  pools: [
    {
      rate: 0,
      units: [],
      reroll: false,
    },
    {
      rate: 6970,
      units: [
       'ネコ武闘家',            // 523
       'ネコマタドール',        // 495
       'ネコ探査機',            // 376
       'ネコボクサー',          // 325
       'ネコバサミ',            // 308
       'ねこ陰陽師',            // 198
       'サイキックネコ',        // 197
       'ねこ人魚',              // 149
       'ねこロッカー',          // 148
       'ブリキネコ',            // 147
       'たけうまねこ',          // 146
       'ねこガンマン',          // 145
       'ネコ魔剣士',            //  58
       'ネコアーチャー',        //  56
       'ネコ魔女',              //  55
       'ネコシャーマン',        //  52
       'ねこ占い師',            //  51
       'ねこ僧侶',              //  50
       'ねこ泥棒',              //  49
       'ねこ海賊',              //  48
       'ねこファイター',        //  47
       'ねこジュラ',            //  46
       'ネコエステ',            //  41
       'ネコ車輪',              //  38
       'ネコホッピング',        //  37
      ],
      reroll: true,
    },
    {
      rate: 2500,
      units: [
       '戦隊チャッソ',          // 447
       '戦隊ショベリン',        // 446
       '戦隊チョキンドス',      // 445
       '戦隊ウチコンガ',        // 444
       '戦隊ドリラ',            // 443
       'メタルネコ',            // 200
       'にゃんこ城Mini',        // 144
       'ねねこ',                // 131
       '金ネコ',                // 129
       'おかめはちもくネコ',    // 237
       'ボンボンネコ',          // 238
       '見習いスニャイパー',    // 239
       '泉のネコ女神',          // 522
       'ネコフェンシング',      // 377
       'ネコジャンパー',        // 307
       'ネコサーファー',        // 199
       'ネコトースター',        // 153
       'ネコスケート',          // 152
       'ネコバーベル',          // 151
       '窓辺の乙女ネコ',        // 150
       'ねこ寿司',              //  61
       'ネコバスたぶ',          //  40
       'ネコリンゴ',            //  39
       'ネコスイマー',          //  36
       'オタネコ',              //  35
       'ねこタツ',              //  33
       'ネコザイル',            //  32
       'ネコ番長',              //  31
       'ネコぼさつ',            //  30
      ],
      reroll: false,
    },
    {
      rate: 500,
      units: [
       '樹の精霊コモリ',        // 817
       '鉄の精霊カッチン',      // 719
       '氷の精霊フリズ',        // 655
       '火の精霊メララ',        // 359
       '水の精霊ミズリィ',      // 360
       '風の精霊エアル',        // 361
       '雷の精霊ボルト',        // 401
       '石の精霊ゴロー',        // 569
       '闇の精霊ヤミィ',        // 631
      ],
      reroll: false,
    },
    {
      rate: 30,
      units: [
       '幻の精霊ルミナ',        // 478
      ],
      reroll: false,
    },
  ],

};
