import { GatyaSet } from "@/data/gatyasets";

export const Set1010: GatyaSet = {
  name: "サマガ赤",
  guaranteed: -1,
  shortName: "1010",
  gatyasetId: 1010,
  rateCumSum: [0, 7000, 9500, 10000],
  pools: [
    {
      rate: 0,
      units: [],
      reroll: false,
    },
    {
      rate: 7000,
      units: [
       'ネコ武闘家',            // 523
       'ネコマタドール',        // 495
       'ネコ探査機',            // 376
       'ネコボクサー',          // 325
       'ネコバサミ',            // 308
       'ねこ陰陽師',            // 198
       'サイキックネコ',        // 197
       'ねこ人魚',              // 149
       'ねこロッカー',          // 148
       'ブリキネコ',            // 147
       'たけうまねこ',          // 146
       'ねこガンマン',          // 145
       'ネコ魔剣士',            //  58
       'ネコアーチャー',        //  56
       'ネコ魔女',              //  55
       'ネコシャーマン',        //  52
       'ねこ占い師',            //  51
       'ねこ僧侶',              //  50
       'ねこ泥棒',              //  49
       'ねこ海賊',              //  48
       'ねこファイター',        //  47
       'ねこジュラ',            //  46
       'ネコエステ',            //  41
       'ネコ車輪',              //  38
       'ネコホッピング',        //  37
      ],
      reroll: true,
    },
    {
      rate: 2500,
      units: [
       '洗脳されしバトルネコ',     // 645
       '洗脳されしネコノトリ',     // 667
       '洗脳されしネコフィッシュ', // 684
       '夏色ねねこ',               // 276
       '夏色ねねこ',               // 276
       '夏色ねねこ',               // 276
       '日焼けネコ',               // 565
       '日焼けネコ',               // 565
       '日焼けネコ',               // 565
       '救命にゃんこ',             // 566
       '救命にゃんこ',             // 566
       '救命にゃんこ',             // 566
       '泉のネコ女神',             // 522
       'ネコフェンシング',         // 377
       'ネコジャンパー',           // 307
       'ネコサーファー',           // 199
       'ネコトースター',           // 153
       'ネコスケート',             // 152
       'ネコバーベル',             // 151
       '窓辺の乙女ネコ',           // 150
       'ねこ寿司',                 //  61
       'ネコバスたぶ',             //  40
       'ネコリンゴ',               //  39
       'ネコスイマー',             //  36
       'オタネコ',                 //  35
       'ねこタツ',                 //  33
       'ネコザイル',               //  32
       'ネコ番長',                 //  31
       'ネコぼさつ',               //  30
      ],
      reroll: false,
    },
    {
      rate: 500,
      units: [
       'シーサイドペガサ',       // 820
       'ナイトビーチリリン',     // 666
       'アクアシューター・サキ', // 563
       '常夏の果実カイ',         // 354
       '灼熱のビーチクウ',       // 438
       '潮風のセーラーカッパー', // 494
      ],
      reroll: false,
    },
  ],

};
