import { GatyaSet } from "@/data/gatyasets";

export const Set452: GatyaSet = {
  name: "エアバスターズ",
  guaranteed: 14,
  shortName: "452",
  gatyasetId: 452,
  rateCumSum: [0, 7000, 9500, 10000],
  pools: [
    {
      rate: 0,
      units: [],
      reroll: false,
    },
    {
      rate: 7000,
      units: [
       'ネコ武闘家',            // 523
       'ネコマタドール',        // 495
       'ネコ探査機',            // 376
       'ネコボクサー',          // 325
       'ネコバサミ',            // 308
       'ねこ陰陽師',            // 198
       'サイキックネコ',        // 197
       'ねこ人魚',              // 149
       'ねこロッカー',          // 148
       'ブリキネコ',            // 147
       'たけうまねこ',          // 146
       'ねこガンマン',          // 145
       'ネコ魔剣士',            //  58
       'ネコアーチャー',        //  56
       'ネコ魔女',              //  55
       'ネコシャーマン',        //  52
       'ねこ占い師',            //  51
       'ねこ僧侶',              //  50
       'ねこ泥棒',              //  49
       'ねこ海賊',              //  48
       'ねこファイター',        //  47
       'ねこジュラ',            //  46
       'ネコエステ',            //  41
       'ネコ車輪',              //  38
       'ネコホッピング',        //  37
      ],
      reroll: true,
    },
    {
      rate: 2500,
      units: [
       '泉のネコ女神',          // 522
       'ネコフェンシング',      // 377
       'ネコジャンパー',        // 307
       '見習いスニャイパー',    // 239
       'ボンボンネコ',          // 238
       'おかめはちもくネコ',    // 237
       'メタルネコ',            // 200
       'にゃんこ城Mini',        // 144
       'ねねこ',                // 131
       '金ネコ',                // 129
       'ネコサーファー',        // 199
       'ネコトースター',        // 153
       'ネコスケート',          // 152
       'ネコバーベル',          // 151
       '窓辺の乙女ネコ',        // 150
       'ねこ寿司',              //  61
       'ネコバスたぶ',          //  40
       'ネコリンゴ',            //  39
       'ネコスイマー',          //  36
       'オタネコ',              //  35
       'ねこタツ',              //  33
       'ネコザイル',            //  32
       'ネコ番長',              //  31
       'ネコぼさつ',            //  30
      ],
      reroll: false,
    },
    {
      rate: 500,
      units: [
       '閃雷機兵レイ',          // 286
       'キャットマンダディ',    // 196
       'ねこナース',            // 143
       'ツルの恩返し',          // 135
       '宝杖のカッパーマイン',  // 107
       '召し豚のカイ',          // 106
       '聖龍メギドラ',          //  84
       '地龍ソドム',            //  83
       '風神のウィンディ',      //  75
       'ねこベビー',            //  59
      ],
      reroll: false,
    },
  ],

};

