import { GatyaSet } from "@/data/gatyasets";

export const Set523: GatyaSet = {
  name: "波動バスターズ",
  guaranteed: 14,
  shortName: "523",
  gatyasetId: 523,
  rateCumSum: [0, 7000, 9500, 10000],
  pools: [
    {
      rate: 0,
      units: [],
      reroll: false,
    },
    {
      rate: 7000,
      units: [
       'ネコホッピング',        //  37
       'ネコ車輪',              //  38
       'ネコエステ',            //  41
       'ねこジュラ',            //  46
       'ねこファイター',        //  47
       'ねこ海賊',              //  48
       'ねこ泥棒',              //  49
       'ねこ僧侶',              //  50
       'ねこ占い師',            //  51
       'ネコシャーマン',        //  52
       'ネコ魔女',              //  55
       'ネコアーチャー',        //  56
       'ネコ魔剣士',            //  58
       'ねこガンマン',          // 145
       'たけうまねこ',          // 146
       'ブリキネコ',            // 147
       'ねこロッカー',          // 148
       'ねこ人魚',              // 149
       'サイキックネコ',        // 197
       'ねこ陰陽師',            // 198
       'ネコバサミ',            // 308
       'ネコボクサー',          // 325
       'ネコ探査機',            // 376
       'ネコマタドール',        // 495
       'ネコ武闘家',            // 523
      ],
      reroll: true,
    },
    {
      rate: 2500,
      units: [
       '見習いスニャイパー',    // 239
       'ボンボンネコ',          // 238
       'おかめはちもくネコ',    // 237
       'メタルネコ',            // 200
       'にゃんこ城Mini',        // 144
       'ねねこ',                // 131
       '金ネコ',                // 129
       'ネコぼさつ',            //  30
       'ネコ番長',              //  31
       'ネコザイル',            //  32
       'ねこタツ',              //  33
       'オタネコ',              //  35
       'ネコスイマー',          //  36
       'ネコリンゴ',            //  39
       'ネコバスたぶ',          //  40
       'ねこ寿司',              //  61
       '窓辺の乙女ネコ',        // 150
       'ネコバーベル',          // 151
       'ネコスケート',          // 152
       'ネコトースター',        // 153
       'ネコサーファー',        // 199
       'ネコジャンパー',        // 307
       'ネコフェンシング',      // 377
       '泉のネコ女神',          // 522
      ],
      reroll: false,
    },
    {
      rate: 500,
      units: [
       '地獄警官エマ',          // 559
       'ラスヴォース',          // 519
       'ノビルガ',              // 436
       '守護神アヌビス',        // 258
       'トゲルガ',              // 240
       'アキラ',                // 194
       '前田慶次',              //  72
       'ネコマシン',            //  43
      ],
      reroll: false,
    },
  ],

};

