import { GatyaSet } from "@/data/gatyasets";

export const Set861: GatyaSet = {
  name: "女王祭",
  guaranteed: -1,
  shortName: "861",
  gatyasetId: 861,
  rateCumSum: [0, 6940, 9440, 9940, 10000],
  pools: [
    {
      rate: 0,
      units: [],
      reroll: false,
    },
    {
      rate: 6940,
      units: [
       'ネコ武闘家',             // 523
       'ネコマタドール',         // 495
       'ネコ探査機',             // 376
       'ネコボクサー',           // 325
       'ネコバサミ',             // 308
       'ねこ陰陽師',             // 198
       'サイキックネコ',         // 197
       'ねこ人魚',               // 149
       'ねこロッカー',           // 148
       'ブリキネコ',             // 147
       'たけうまねこ',           // 146
       'ねこガンマン',           // 145
       'ネコ魔剣士',             //  58
       'ネコアーチャー',         //  56
       'ネコ魔女',               //  55
       'ネコシャーマン',         //  52
       'ねこ占い師',             //  51
       'ねこ僧侶',               //  50
       'ねこ泥棒',               //  49
       'ねこ海賊',               //  48
       'ねこファイター',         //  47
       'ねこジュラ',             //  46
       'ネコエステ',             //  41
       'ネコ車輪',               //  38
       'ネコホッピング',         //  37
      ],
      reroll: true,
    },
    {
      rate: 2500,
      units: [
       '泉のネコ女神',           // 522
       'ネコフェンシング',       // 377
       'ネコジャンパー',         // 307
       'ネコサーファー',         // 199
       'ネコトースター',         // 153
       'ネコスケート',           // 152
       'ネコバーベル',           // 151
       '窓辺の乙女ネコ',         // 150
       'ねこ寿司',               //  61
       'ネコバスたぶ',           //  40
       'ネコリンゴ',             //  39
       'ネコスイマー',           //  36
       'オタネコ',               //  35
       'ねこタツ',               //  33
       'ネコザイル',             //  32
       'ネコ番長',               //  31
       'ネコぼさつ',             //  30
      ],
      reroll: false,
    },
    {
      rate: 500,
      units: [
       'ねこナース',             // 143
       '成田甲斐',               // 496
       '妖賢女リリン',           // 619
       '舌切りすずめ',           // 633
       'ホワイトラビット',       // 212
       '太陽神アマテラス',       // 271
       '女神ベガ',               // 682
       'ネコアイスゴースト',     // 302
       'トナカイ娘テルン',       // 687
       '波打ち際の冒険家カンナ', // 714
       '上杉謙信・春',           // 330
       '白い恋人メカ子',         // 644
       '祝福神クロノス',         // 661
       'ネコ王女',               // 612
      ],
      reroll: false,
    },
    {
      rate: 60,
      units: [
       '宮本武蔵',               // 448
       '聖会長ジャンヌダルク',   // 449
       '天城龍バベル',           // 450
       'うしわか丸',             // 451
       'ワンダー・モモコ',       // 455
       'レジェルガ',             // 461
       '終末兵器ムー',           // 463
       '幻の精霊ルミナ',         // 478
       '超越科学者ヘヴン博士',   // 481
       '創造神ガイア',           // 493
       '京坂七穂',               // 544
      ],
      reroll: false,
    },
  ],

};

