import { GatyaSet } from "@/data/gatyasets";

export const Set990: GatyaSet = {
  name: "極選抜祭(対トリクシー入り)",
  guaranteed: -1,
  shortName: "990",
  gatyasetId: 990,
  rateCumSum: [0, 7000, 9500, 10000],
  pools: [
    {
      rate: 0,
      units: [],
      reroll: false,
    },
    {
      rate: 7000,
      units: [
       'ネコ武闘家',            // 523
       'ネコマタドール',        // 495
       'ネコ探査機',            // 376
       'ネコボクサー',          // 325
       'ネコバサミ',            // 308
       'ねこ陰陽師',            // 198
       'サイキックネコ',        // 197
       'ねこ人魚',              // 149
       'ねこロッカー',          // 148
       'ブリキネコ',            // 147
       'たけうまねこ',          // 146
       'ねこガンマン',          // 145
       'ネコ魔剣士',            //  58
       'ネコアーチャー',        //  56
       'ネコ魔女',              //  55
       'ネコシャーマン',        //  52
       'ねこ占い師',            //  51
       'ねこ僧侶',              //  50
       'ねこ泥棒',              //  49
       'ねこ海賊',              //  48
       'ねこファイター',        //  47
       'ねこジュラ',            //  46
       'ネコエステ',            //  41
       'ネコ車輪',              //  38
       'ネコホッピング',        //  37
      ],
      reroll: true,
    },
    {
      rate: 2500,
      units: [
       'ネコ七福神',            // 520
       '泉のネコ女神',          // 522
       'ネコフェンシング',      // 377
       'ネコジャンパー',        // 307
       'ネコサーファー',        // 199
       'ネコトースター',        // 153
       'ネコスケート',          // 152
       'ネコバーベル',          // 151
       '窓辺の乙女ネコ',        // 150
       'ねこ寿司',              //  61
       'ネコバスたぶ',          //  40
       'ネコリンゴ',            //  39
       'ネコスイマー',          //  36
       'オタネコ',              //  35
       'ねこタツ',              //  33
       'ネコザイル',            //  32
       'ネコ番長',              //  31
       'ネコぼさつ',            //  30
      ],
      reroll: false,
    },
    {
      rate: 500,
      units: [
       '811_1',                  // 810
       'ネコルガ',               //  34
       'ネコマシン',             //  43
       '成田甲斐',               // 496
       '冥界のカリファ',         // 159
       '竜戦機ライデン',         //  87
       '舌切りすずめ',           // 633
       '特命機動アクセル',       // 774
       '繁栄神ガネーシャ',       // 272
       '周遊芸団カルーセルズ',   // 674
       '狐娘ヒメユリ',           // 334
       '火の精霊メララ',         // 359
       '黒ちびネコヴァルキリー', // 484
      ],
      reroll: false,
    },
  ],

};
