import { GatyaSet } from "@/data/gatyasets";

export const Set999: GatyaSet = {
  name: "エヴァ新劇場版",
  guaranteed:  10,
  shortName: "999",
  gatyasetId: 999,
  rateCumSum: [0, 6970, 9470, 9970, 10000],
  pools: [
    {
      rate: 0,
      units: [],
      reroll: false,
    },
    {
      rate: 6970,
      units: [
       'ネコレイ',              // 406
       'ネコレイ',              // 406
       'ネコレイ',              // 406
       'ネコアスカ',            // 407
       'ネコアスカ',            // 407
       'ネコアスカ',            // 407
       'ネコマリ',              // 408
       'ネコマリ',              // 408
       'ネコマリ',              // 408
       'ネコカヲル',            // 552
       'ネコカヲル',            // 552
       'ネコカヲル',            // 552
       'ネコ武闘家',            // 523
       'ネコマタドール',        // 495
       'ネコ探査機',            // 376
       'ネコボクサー',          // 325
       'ネコバサミ',            // 308
       'ねこ陰陽師',            // 198
       'サイキックネコ',        // 197
       'ねこ人魚',              // 149
       'ねこロッカー',          // 148
       'ブリキネコ',            // 147
       'たけうまねこ',          // 146
       'ねこガンマン',          // 145
       'ネコ魔剣士',            //  58
       'ネコアーチャー',        //  56
       'ネコ魔女',              //  55
       'ネコシャーマン',        //  52
       'ねこ占い師',            //  51
       'ねこ僧侶',              //  50
       'ねこ泥棒',              //  49
       'ねこ海賊',              //  48
       'ねこファイター',        //  47
       'ねこジュラ',            //  46
       'ネコエステ',            //  41
       'ネコ車輪',              //  38
       'ネコホッピング',        //  37
      ],
      reroll: true,
    },
    {
      rate: 2500,
      units: [
       'ちびマリ',               // 411
       'ちびリツコ',             // 490
       'ちびアヤナミレイ(仮称)', // 491
       '泉のネコ女神',           // 522
       'ネコフェンシング',       // 377
       'ネコジャンパー',         // 307
       'ネコサーファー',         // 199
       'ネコトースター',         // 153
       'ネコスケート',           // 152
       'ネコバーベル',           // 151
       '窓辺の乙女ネコ',         // 150
       'ねこ寿司',               //  61
       'ネコバスたぶ',           //  40
       'ネコリンゴ',             //  39
       'ネコスイマー',           //  36
       'オタネコ',               //  35
       'ねこタツ',               //  33
       'ネコザイル',             //  32
       'ネコ番長',               //  31
       'ネコぼさつ',             //  30
      ],
      reroll: false,
    },
    {
      rate: 500,
      units: [
       'エヴァ２号機',             // 414
       'ゼロムーンオペレーターズ', // 416
       'エヴァ８号機',             // 487
       '空中艦艇ネコヴンダー',     // 488
       '第４の使徒',               // 548
       '第９の使徒',               // 551
       '隻眼の少女アスカ',         // 709
       'エヴァ第１３号機',         // 710
      ],
      reroll: false,
    },
    {
      rate: 30,
      units: [
       '月影の少年カヲル',      // 815
      ],
      reroll: false,
    },
  ],

};
