import { GatyaSet } from "@/data/gatyasets";

export const Set973: GatyaSet = {
  name: "超国王祭",
  guaranteed: -1,
  shortName: "973",
  gatyasetId: 973,
  rateCumSum: [0, 6770, 9270, 9970, 10000],
  pools: [
    {
      rate: 0,
      units: [],
      reroll: false,
    },
    {
      rate: 6770,
      units: [
       'ネコ武闘家',            // 523
       'ネコマタドール',        // 495
       'ネコ探査機',            // 376
       'ネコボクサー',          // 325
       'ネコバサミ',            // 308
       'ねこ陰陽師',            // 198
       'サイキックネコ',        // 197
       'ねこ人魚',              // 149
       'ねこロッカー',          // 148
       'ブリキネコ',            // 147
       'たけうまねこ',          // 146
       'ねこガンマン',          // 145
       'ネコ魔剣士',            //  58
       'ネコアーチャー',        //  56
       'ネコ魔女',              //  55
       'ネコシャーマン',        //  52
       'ねこ占い師',            //  51
       'ねこ僧侶',              //  50
       'ねこ泥棒',              //  49
       'ねこ海賊',              //  48
       'ねこファイター',        //  47
       'ねこジュラ',            //  46
       'ネコエステ',            //  41
       'ネコ車輪',              //  38
       'ネコホッピング',        //  37
      ],
      reroll: true,
    },
    {
      rate: 2500,
      units: [
       'スモウ・ザ・ミイラ',    // 773
       'バレンタインねねこ',    // 589
       '救命にゃんこ',          // 566
       '日焼けネコ',            // 565
       'イースターねねこ',      // 332
       '大掃除ねねこ',          // 314
       '夏色ねねこ',            // 276
       'ハロウィンねねこ',      // 228
       '泉のネコ女神',          // 522
       'ネコフェンシング',      // 377
       'ネコジャンパー',        // 307
       'ネコサーファー',        // 199
       'ネコトースター',        // 153
       'ネコスケート',          // 152
       'ネコバーベル',          // 151
       '窓辺の乙女ネコ',        // 150
       'ねこ寿司',              //  61
       'ネコバスたぶ',          //  40
       'ネコリンゴ',            //  39
       'ネコスイマー',          //  36
       'オタネコ',              //  35
       'ねこタツ',              //  33
       'ネコザイル',            //  32
       'ネコ番長',              //  31
       'ネコぼさつ',            //  30
      ],
      reroll: false,
    },
    {
      rate: 700,
      units: [
       'マジシャンキャットマン',   // 786
       '冬将軍・成田甲斐',         // 777
       'パンプキンソドム',         // 772
       'サマーフェスサンディア',   // 759
       'ネコケーキマシン挙式',     // 756
       'スプリングカリファ',       // 737
       'ネコアイスホワイトスター', // 736
       '波打ち際の冒険家カンナ',   // 714
       'バララガの誓い',           // 711
       '決闘少年ラビットサトル',   // 699
       '白執事探偵ヴィグラー',     // 693
       'トナカイ娘テルン',         // 687
       '伯爵・真田幸村',           // 683
       'ナイトビーチリリン',       // 666
       '祝福神クロノス',           // 661
       '恋番長・鬼にゃんま',       // 648
       '白い恋人メカ子',           // 644
       '渚のかぐやひめ',           // 614
       '春龍かむくら',             // 595
       '初恋令嬢メルシュ',         // 588
       '恋女神ショコラディーテ',   // 587
       '前田サンタ慶次',           // 584
       '竜騎士スカルバルス',       // 570
       'ネコルガの夏',             // 564
       'アクアシューター・サキ',   // 563
       '冬天使のシシル＆コマリ',   // 526
       '潮風のセーラーカッパー',   // 494
       '灼熱のビーチクウ',         // 438
       '常夏の果実カイ',           // 354
       '道化師エッグダック',       // 331
       '上杉謙信・春',             // 330
       'ネコナースキャンドル',     // 310
       'ネコアイスゴースト',       // 302
       '真夏のホワイトラビット',   // 275
       'トロピカルカリファ',       // 274
       '聖夜のシスターカッパー',   // 243
       'サンタのメリークウ',       // 242
       '雪だるまのスノーカイ',     // 241
       'デビルサンディア',         // 230
       'ウィンディスイート',       // 229
      ],
      reroll: false,
    },
    {
      rate: 30,
      units: [
       'ネコ王子',              // 586
      ],
      reroll: false,
    },
  ],

};
