import { GatyaSet } from "@/data/gatyasets";

export const Set950: GatyaSet = {
  name: "ギャルモン",
  guaranteed: -1,
  shortName: "950",
  gatyasetId: 950,
  rateCumSum: [0, 6970, 9470, 9970, 10000],
  pools: [
    {
      rate: 0,
      units: [],
      reroll: false,
    },
    {
      rate: 6970,
      units: [
       'ネコ武闘家',            // 523
       'ネコマタドール',        // 495
       'ネコ探査機',            // 376
       'ネコボクサー',          // 325
       'ネコバサミ',            // 308
       'ねこ陰陽師',            // 198
       'サイキックネコ',        // 197
       'ねこ人魚',              // 149
       'ねこロッカー',          // 148
       'ブリキネコ',            // 147
       'たけうまねこ',          // 146
       'ねこガンマン',          // 145
       'ネコ魔剣士',            //  58
       'ネコアーチャー',        //  56
       'ネコ魔女',              //  55
       'ネコシャーマン',        //  52
       'ねこ占い師',            //  51
       'ねこ僧侶',              //  50
       'ねこ泥棒',              //  49
       'ねこ海賊',              //  48
       'ねこファイター',        //  47
       'ねこジュラ',            //  46
       'ネコエステ',            //  41
       'ネコ車輪',              //  38
       'ネコホッピング',        //  37
      ],
      reroll: true,
    },
    {
      rate: 2500,
      units: [
       '泉のネコ女神',          // 522
       '戦隊チャッソ',          // 447
       '戦隊ショベリン',        // 446
       '戦隊チョキンドス',      // 445
       '戦隊ウチコンガ',        // 444
       '戦隊ドリラ',            // 443
       'ネコフェンシング',      // 377
       'メタルネコ',            // 200
       'にゃんこ城Mini',        // 144
       'ねねこ',                // 131
       '金ネコ',                // 129
       'おかめはちもくネコ',    // 237
       'ボンボンネコ',          // 238
       '見習いスニャイパー',    // 239
       'ネコジャンパー',        // 307
       'ネコサーファー',        // 199
       'ネコトースター',        // 153
       'ネコスケート',          // 152
       'ネコバーベル',          // 151
       '窓辺の乙女ネコ',        // 150
       'ねこ寿司',              //  61
       'ネコバスたぶ',          //  40
       'ネコリンゴ',            //  39
       'ネコスイマー',          //  36
       'オタネコ',              //  35
       'ねこタツ',              //  33
       'ネコザイル',            //  32
       'ネコ番長',              //  31
       'ネコぼさつ',            //  30
      ],
      reroll: false,
    },
    {
      rate: 500,
      units: [
       '忍者娘トモエ',           // 725
       '女神ベガ',               // 682
       '冒険家カンナ',           // 607
       'ゾンビ娘ヴェルヴェーヌ', // 358
       '狼娘ディル',             // 357
       'ミイラ娘レイカ',         // 336
       '人魚娘ルリィ',           // 335
       '狐娘ヒメユリ',           // 334
      ],
      reroll: false,
    },
    {
      rate: 30,
      units: [
       '京坂七穂',              // 544
      ],
      reroll: false,
    },
  ],

};

