import { GatyaSet } from "@/data/gatyasets";

export const Set998: GatyaSet = {
  name: "エヴァ新世紀",
  guaranteed:  10,
  shortName: "998",
  gatyasetId: 998,
  rateCumSum: [0, 6970, 9470, 9970, 10000],
  pools: [
    {
      rate: 0,
      units: [],
      reroll: false,
    },
    {
      rate: 6970,
      units: [
       'ネコレイ',              // 406
       'ネコレイ',              // 406
       'ネコレイ',              // 406
       'ネコアスカ',            // 407
       'ネコアスカ',            // 407
       'ネコアスカ',            // 407
       'ネコマリ',              // 408
       'ネコマリ',              // 408
       'ネコマリ',              // 408
       'ネコカヲル',            // 552
       'ネコカヲル',            // 552
       'ネコカヲル',            // 552
       'ネコ武闘家',            // 523
       'ネコマタドール',        // 495
       'ネコ探査機',            // 376
       'ネコボクサー',          // 325
       'ネコバサミ',            // 308
       'ねこ陰陽師',            // 198
       'サイキックネコ',        // 197
       'ねこ人魚',              // 149
       'ねこロッカー',          // 148
       'ブリキネコ',            // 147
       'たけうまねこ',          // 146
       'ねこガンマン',          // 145
       'ネコ魔剣士',            //  58
       'ネコアーチャー',        //  56
       'ネコ魔女',              //  55
       'ネコシャーマン',        //  52
       'ねこ占い師',            //  51
       'ねこ僧侶',              //  50
       'ねこ泥棒',              //  49
       'ねこ海賊',              //  48
       'ねこファイター',        //  47
       'ねこジュラ',            //  46
       'ネコエステ',            //  41
       'ネコ車輪',              //  38
       'ネコホッピング',        //  37
      ],
      reroll: true,
    },
    {
      rate: 2500,
      units: [
       'ちびレイ',              // 409
       'ちびアスカ',            // 410
       'ちびミサト',            // 489
       '泉のネコ女神',          // 522
       'ネコフェンシング',      // 377
       'ネコジャンパー',        // 307
       'ネコサーファー',        // 199
       'ネコトースター',        // 153
       'ネコスケート',          // 152
       'ネコバーベル',          // 151
       '窓辺の乙女ネコ',        // 150
       'ねこ寿司',              //  61
       'ネコバスたぶ',          //  40
       'ネコリンゴ',            //  39
       'ネコスイマー',          //  36
       'オタネコ',              //  35
       'ねこタツ',              //  33
       'ネコザイル',            //  32
       'ネコ番長',              //  31
       'ネコぼさつ',            //  30
      ],
      reroll: false,
    },
    {
      rate: 500,
      units: [
       'エヴァ量産機',          // 814
       'エヴァ零号機',          // 412
       'エヴァ初号機',          // 413
       'ネコシンジ',            // 415
       '白夜姫のレイ',          // 547
       '第６の使徒',            // 549
       '第１０の使徒',          // 550
      ],
      reroll: false,
    },
    {
      rate: 30,
      units: [
       '月影の少年カヲル',      // 815
      ],
      reroll: false,
    },
  ],

};
