import { GatyaSet } from "@/data/gatyasets";

export const Set944: GatyaSet = {
  name: "ギャルズ",
  guaranteed: -1,
  shortName: "944",
  gatyasetId: 944,
  rateCumSum: [0, 6970, 9470, 9970, 10000],
  pools: [
    {
      rate: 0,
      units: [],
      reroll: false,
    },
    {
      rate: 6970,
      units: [
       'ネコ武闘家',            // 523
       'ネコマタドール',        // 495
       'ネコ探査機',            // 376
       'ネコボクサー',          // 325
       'ネコバサミ',            // 308
       'ねこ陰陽師',            // 198
       'サイキックネコ',        // 197
       'ねこ人魚',              // 149
       'ねこロッカー',          // 148
       'ブリキネコ',            // 147
       'たけうまねこ',          // 146
       'ねこガンマン',          // 145
       'ネコ魔剣士',            //  58
       'ネコアーチャー',        //  56
       'ネコ魔女',              //  55
       'ネコシャーマン',        //  52
       'ねこ占い師',            //  51
       'ねこ僧侶',              //  50
       'ねこ泥棒',              //  49
       'ねこ海賊',              //  48
       'ねこファイター',        //  47
       'ねこジュラ',            //  46
       'ネコエステ',            //  41
       'ネコ車輪',              //  38
       'ネコホッピング',        //  37
      ],
      reroll: true,
    },
    {
      rate: 2500,
      units: [
       '戦隊チャッソ',          // 447
       '戦隊ショベリン',        // 446
       '戦隊チョキンドス',      // 445
       '戦隊ウチコンガ',        // 444
       '戦隊ドリラ',            // 443
       'メタルネコ',            // 200
       'にゃんこ城Mini',        // 144
       'ねねこ',                // 131
       '金ネコ',                // 129
       'おかめはちもくネコ',    // 237
       'ボンボンネコ',          // 238
       '見習いスニャイパー',    // 239
       '泉のネコ女神',          // 522
       'ネコフェンシング',      // 377
       'ネコジャンパー',        // 307
       'ネコサーファー',        // 199
       'ネコトースター',        // 153
       'ネコスケート',          // 152
       'ネコバーベル',          // 151
       '窓辺の乙女ネコ',        // 150
       'ねこ寿司',              //  61
       'ネコバスたぶ',          //  40
       'ネコリンゴ',            //  39
       'ネコスイマー',          //  36
       'オタネコ',              //  35
       'ねこタツ',              //  33
       'ネコザイル',            //  32
       'ネコ番長',              //  31
       'ネコぼさつ',            //  30
      ],
      reroll: false,
    },
    {
      rate: 500,
      units: [
       '鉄籠のペガサ',           // 733
       '狩猟娘テルン',           // 647
       '妖賢女リリン',           // 619
       '英雄令嬢メルシュ',       // 502
       '双掌星のシシル＆コマリ', // 351
       '冥界のカリファ',         // 159
       '宝杖のカッパーマイン',   // 107
       '召し豚のカイ',           // 106
       '猿帝のクウ',             // 105
       '雷神のサンディア',       //  76
       '風神のウィンディ',       //  75
      ],
      reroll: false,
    },
    {
      rate: 30,
      units: [
       '聖会長ジャンヌダルク',  // 449
      ],
      reroll: false,
    },
  ],

};
