import { GatyaSet } from "@/data/gatyasets";

export const Set972: GatyaSet = {
  name: "超極ネコ",
  guaranteed: -1,
  shortName: "972",
  gatyasetId: 972,
  rateCumSum: [0, 6470, 8970, 9970, 10000],
  pools: [
    {
      rate: 0,
      units: [],
      reroll: false,
    },
    {
      rate: 6470,
      units: [
       'ネコ武闘家',            // 523
       'ネコマタドール',        // 495
       'ネコ探査機',            // 376
       'ネコボクサー',          // 325
       'ネコバサミ',            // 308
       'ねこ陰陽師',            // 198
       'サイキックネコ',        // 197
       'ねこ人魚',              // 149
       'ねこロッカー',          // 148
       'ブリキネコ',            // 147
       'たけうまねこ',          // 146
       'ねこガンマン',          // 145
       'ネコ魔剣士',            //  58
       'ネコアーチャー',        //  56
       'ネコ魔女',              //  55
       'ネコシャーマン',        //  52
       'ねこ占い師',            //  51
       'ねこ僧侶',              //  50
       'ねこ泥棒',              //  49
       'ねこ海賊',              //  48
       'ねこファイター',        //  47
       'ねこジュラ',            //  46
       'ネコエステ',            //  41
       'ネコ車輪',              //  38
       'ネコホッピング',        //  37
      ],
      reroll: true,
    },
    {
      rate: 2500,
      units: [
       'ネコ七福神',            // 520
       '泉のネコ女神',          // 522
       'ネコフェンシング',      // 377
       'ネコジャンパー',        // 307
       'ネコサーファー',        // 199
       'ネコトースター',        // 153
       'ネコスケート',          // 152
       'ネコバーベル',          // 151
       '窓辺の乙女ネコ',        // 150
       'ねこ寿司',              //  61
       'ネコバスたぶ',          //  40
       'ネコリンゴ',            //  39
       'ネコスイマー',          //  36
       'オタネコ',              //  35
       'ねこタツ',              //  33
       'ネコザイル',            //  32
       'ネコ番長',              //  31
       'ネコぼさつ',            //  30
      ],
      reroll: false,
    },
    {
      rate: 1000,
      units: [
       '冥護の天女ルナーシャ',   // 787
       'マモルガ',               // 781
       '幼天女ルーナ',           // 779
       '特命機動アクセル',       // 774
       '花咲かじいさん',         // 769
       'ネコダイナザウルス',     // 763
       '砲龍ガンドロス',         // 760
       '明智光秀',               // 754
       '鉄籠のペガサ',           // 733
       '光翼神イシス',           // 723
       '鉄の精霊カッチン',       // 719
       '建築兵団スフィンクス',   // 715
       'カオルガ',               // 712
       '非命の王フォノウ',       // 705
       'サンダージャック',       // 698
       'いっすん法師',           // 692
       '運命の子フォノ',         // 690
       '周遊芸団カルーセルズ',   // 674
       'ネコ天狗',               // 668
       '海龍ダライアサン',       // 660
       '悲嘆の踊り子イズ',       // 657
       '氷の精霊フリズ',         // 655
       '服部半蔵',               // 649
       '狩猟娘テルン',           // 647
       '堕天神ルシファー',       // 642
       '踊り子イズ',             // 641
       '白騎士キュクロプス',     // 634
       '舌切りすずめ',           // 633
       '超竜戦機デス・トロイ',   // 632
       '闇の精霊ヤミィ',         // 631
       'オコルガ',               // 625
       '邪龍ヘヴィジャーク',     // 620
       '妖賢女リリン',           // 619
       '天草四郎',               // 618
       '召喚少年サトル',         // 617
       '黒獣ガルディアン',       // 609
       '空中商会コロンブス',     // 594
       '幼獣ガル',               // 585
       '石の精霊ゴロー',         // 569
       'オイルガ',               // 546
       '禍根の魔女キャスリィ',   // 543
       '冥界神ハデス',           // 534
       'マッドシューター・サキ', // 533
       '厄災の子キャスリィ',     // 529
       'きんたろう',             // 525
       'ラスヴォース',           // 519
       '角龍グラディオス',       // 505
       '英雄令嬢メルシュ',       // 502
       '成田甲斐',               // 496
       '影傑ダークダルターニャ', // 441
       '時空神クロノス',         // 439
       'ノビルガ',               // 436
       '亡者探偵ヴィグラー',     // 431
       'ネコクエスト',           // 427
       '温泉天国テルマエ',       // 417
       '雷の精霊ボルト',         // 401
       '古龍ガングリオン',       // 396
       '幼傑ダルターニャ',       // 380
       '黒無垢のミタマ',         // 378
       '風の精霊エアル',         // 361
       '水の精霊ミズリィ',       // 360
       '火の精霊メララ',         // 359
       '観測兵器ガリレオ',       // 355
       '双掌星のシシル＆コマリ', // 351
       '今川義元',               // 338
       '黒獣ガオウ',             // 333
       'さるかに合戦',           // 322
       '巫女姫ミタマ',           // 318
       '海王神ポセイドン',       // 316
       '飛空襲撃ボンバーズ',     // 306
       '古代軍船ガレーズ',       // 305
       '帝国陸軍カタパルズ',     // 304
       '繁栄神ガネーシャ',       // 272
       '太陽神アマテラス',       // 271
       '幼獣ガオ',               // 269
       '天誅ハヤブサ',           // 261
       '美女神アフロディーテ',   // 259
       '守護神アヌビス',         // 258
       '天空神ゼウス',           // 257
       'トゲルガ',               // 240
       '呪術師デスピエロ',       // 226
       'ホワイトラビット',       // 212
       'カチカチヤマンズ',       // 203
       'キャットマンダディ',     // 196
       '西園寺メカ子',           // 195
       'アキラ',                 // 194
       '覇龍ディオラムス',       // 177
       'バララガ',               // 171
       'テコルガ',               // 170
       'クビルガ',               // 169
       'アシルガ',               // 168
       '冥界のカリファ',         // 159
       '上杉謙信',               // 158
       'ねこナース',             // 143
       'かぐやひめ',             // 138
       'かさじぞう',             // 137
       'ももたろう',             // 136
       'ツルの恩返し',           // 135
       'うらしまタロウ',         // 134
       '武田信玄',               // 125
       '伊達政宗',               // 124
       '宝杖のカッパーマイン',   // 107
       '召し豚のカイ',           // 106
       '猿帝のクウ',             // 105
       '竜戦機ライデン',         //  87
       '神龍かむくら',           //  86
       '竜騎士バルス',           //  85
       '聖龍メギドラ',           //  84
       '地龍ソドム',             //  83
       '雷神のサンディア',       //  76
       '風神のウィンディ',       //  75
       '織田信長',               //  73
       '前田慶次',               //  72
       '真田幸村',               //  71
       'ねこベビー',             //  59
       'ネコシュバリエ',         //  57
       '鬼にゃんま',             //  44
       'ネコマシン',             //  43
       'ネコアイス',             //  42
       'ネコルガ',               //  34
      ],
      reroll: false,
    },
    {
      rate: 30,
      units: [
       '宵のイザナミ',          // 738
       '暁のイザナギ',          // 731
      ],
      reroll: false,
    },
  ],

};
