import { GatyaSet } from "@/data/gatyasets";

export const Set970: GatyaSet = {
  name: "プラチケ",
  guaranteed: -1,
  shortName: "970",
  gatyasetId: 970,
  rateCumSum: [0, 0, 0, 10000],
  pools: [
    {
      rate: 0,
      units: [],
      reroll: false,
    },
    {
      rate: 0,
      units: [],
      reroll: false,
    },
    {
      rate: 0,
      units: [],
      reroll: false,
    },
    {
      rate: 10000,
      units: [
       '冥護の天女ルナーシャ',   // 787
       'マモルガ',               // 781
       '幼天女ルーナ',           // 779
       '特命機動アクセル',       // 774
       '花咲かじいさん',         // 769
       'ネコダイナザウルス',     // 763
       '砲龍ガンドロス',         // 760
       '明智光秀',               // 754
       '鉄籠のペガサ',           // 733
       '光翼神イシス',           // 723
       '鉄の精霊カッチン',       // 719
       '建築兵団スフィンクス',   // 715
       'カオルガ',               // 712
       '非命の王フォノウ',       // 705
       'サンダージャック',       // 698
       'いっすん法師',           // 692
       '運命の子フォノ',         // 690
       '光の女神シリウス',       // 686
       '周遊芸団カルーセルズ',   // 674
       'ネコ天狗',               // 668
       '海龍ダライアサン',       // 660
       '悲嘆の踊り子イズ',       // 657
       '氷の精霊フリズ',         // 655
       '服部半蔵',               // 649
       '狩猟娘テルン',           // 647
       '堕天神ルシファー',       // 642
       '踊り子イズ',             // 641
       '白騎士キュクロプス',     // 634
       '舌切りすずめ',           // 633
       '超竜戦機デス・トロイ',   // 632
       '闇の精霊ヤミィ',         // 631
       'オコルガ',               // 625
       '邪龍ヘヴィジャーク',     // 620
       '妖賢女リリン',           // 619
       '天草四郎',               // 618
       '召喚少年サトル',         // 617
       'ネコ王女',               // 612
       '黒獣ガルディアン',       // 609
       '空中商会コロンブス',     // 594
       '幼獣ガル',               // 585
       '石の精霊ゴロー',         // 569
       '地獄警官エマ',           // 559
       'オイルガ',               // 546
       '禍根の魔女キャスリィ',   // 543
       '冥界神ハデス',           // 534
       'マッドシューター・サキ', // 533
       '厄災の子キャスリィ',     // 529
       'きんたろう',             // 525
       'ラスヴォース',           // 519
       '角龍グラディオス',       // 505
       '英雄令嬢メルシュ',       // 502
       '成田甲斐',               // 496
       '影傑ダークダルターニャ', // 441
       '時空神クロノス',         // 439
       'ノビルガ',               // 436
       '亡者探偵ヴィグラー',     // 431
       'ネコクエスト',           // 427
       '温泉天国テルマエ',       // 417
       '雷の精霊ボルト',         // 401
       '風隼さくら',             // 397
       '古龍ガングリオン',       // 396
       '幼傑ダルターニャ',       // 380
       '黒無垢のミタマ',         // 378
       '風の精霊エアル',         // 361
       '水の精霊ミズリィ',       // 360
       '火の精霊メララ',         // 359
       '観測兵器ガリレオ',       // 355
       '双掌星のシシル＆コマリ', // 351
       '今川義元',               // 338
       '黒獣ガオウ',             // 333
       'さるかに合戦',           // 322
       '巫女姫ミタマ',           // 318
       '海王神ポセイドン',       // 316
       '飛空襲撃ボンバーズ',     // 306
       '古代軍船ガレーズ',       // 305
       '帝国陸軍カタパルズ',     // 304
       '閃雷機兵レイ',           // 286
       '猫飯拳パイパイ',         // 283
       '幼獣ガオ',               // 269
       'ネコルガ',               //  34
       'アシルガ',               // 168
       'クビルガ',               // 169
       'テコルガ',               // 170
       'バララガ',               // 171
       'トゲルガ',               // 240
       'ネコアイス',             //  42
       'ネコマシン',             //  43
       '鬼にゃんま',             //  44
       'ネコシュバリエ',         //  57
       'ねこベビー',             //  59
       'ねこナース',             // 143
       '真田幸村',               //  71
       '前田慶次',               //  72
       '織田信長',               //  73
       '伊達政宗',               // 124
       '武田信玄',               // 125
       '上杉謙信',               // 158
       '風神のウィンディ',       //  75
       '雷神のサンディア',       //  76
       '猿帝のクウ',             // 105
       '召し豚のカイ',           // 106
       '宝杖のカッパーマイン',   // 107
       '冥界のカリファ',         // 159
       '地龍ソドム',             //  83
       '聖龍メギドラ',           //  84
       '竜騎士バルス',           //  85
       '神龍かむくら',           //  86
       '竜戦機ライデン',         //  87
       '覇龍ディオラムス',       // 177
       'うらしまタロウ',         // 134
       'ツルの恩返し',           // 135
       'ももたろう',             // 136
       'かさじぞう',             // 137
       'かぐやひめ',             // 138
       'カチカチヤマンズ',       // 203
       'アキラ',                 // 194
       '西園寺メカ子',           // 195
       'キャットマンダディ',     // 196
       'ホワイトラビット',       // 212
       '呪術師デスピエロ',       // 226
       '天誅ハヤブサ',           // 261
       '天空神ゼウス',           // 257
       '守護神アヌビス',         // 258
       '美女神アフロディーテ',   // 259
       '太陽神アマテラス',       // 271
       '繁栄神ガネーシャ',       // 272
      ],
      reroll: false,
    },
  ],

};
