import { GatyaSet } from "@/data/gatyasets";

export const Set947: GatyaSet = {
  name: "ダークヒーローズ",
  shortName: "947",
  gatyasetId: 947,
  guaranteed: -1,
  rateCumSum: [0, 6970, 9470, 9970, 10000],
  pools: [
    {
      rate: 0,
      units: [],
      reroll: false,
    },
    {
      rate: 6970,
      units: [
       'ネコ武闘家',            // 523
       'ネコマタドール',        // 495
       'ネコ探査機',            // 376
       'ネコボクサー',          // 325
       'ネコバサミ',            // 308
       'ねこ陰陽師',            // 198
       'サイキックネコ',        // 197
       'ねこ人魚',              // 149
       'ねこロッカー',          // 148
       'ブリキネコ',            // 147
       'たけうまねこ',          // 146
       'ねこガンマン',          // 145
       'ネコ魔剣士',            //  58
       'ネコアーチャー',        //  56
       'ネコ魔女',              //  55
       'ネコシャーマン',        //  52
       'ねこ占い師',            //  51
       'ねこ僧侶',              //  50
       'ねこ泥棒',              //  49
       'ねこ海賊',              //  48
       'ねこファイター',        //  47
       'ねこジュラ',            //  46
       'ネコエステ',            //  41
       'ネコ車輪',              //  38
       'ネコホッピング',        //  37
      ],
      reroll: true,
    },
    {
      rate: 2500,
      units: [
       '戦隊チャッソ',          // 447
       '戦隊ショベリン',        // 446
       '戦隊チョキンドス',      // 445
       '戦隊ウチコンガ',        // 444
       '戦隊ドリラ',            // 443
       'メタルネコ',            // 200
       'にゃんこ城Mini',        // 144
       'ねねこ',                // 131
       '金ネコ',                // 129
       'おかめはちもくネコ',    // 237
       'ボンボンネコ',          // 238
       '見習いスニャイパー',    // 239
       '泉のネコ女神',          // 522
       'ネコフェンシング',      // 377
       'ネコジャンパー',        // 307
       'ネコサーファー',        // 199
       'ネコトースター',        // 153
       'ネコスケート',          // 152
       'ネコバーベル',          // 151
       '窓辺の乙女ネコ',        // 150
       'ねこ寿司',              //  61
       'ネコバスたぶ',          //  40
       'ネコリンゴ',            //  39
       'ネコスイマー',          //  36
       'オタネコ',              //  35
       'ねこタツ',              //  33
       'ネコザイル',            //  32
       'ネコ番長',              //  31
       'ネコぼさつ',            //  30
      ],
      reroll: false,
    },
    {
      rate: 500,
      units: [
       '特命機動アクセル',       // 774
       'サンダージャック',       // 698
       '白騎士キュクロプス',     // 634
       'マッドシューター・サキ', // 533
       '亡者探偵ヴィグラー',     // 431
       '天誅ハヤブサ',           // 261
       '呪術師デスピエロ',       // 226
       'ホワイトラビット',       // 212
       'キャットマンダディ',     // 196
       '西園寺メカ子',           // 195
       'アキラ',                 // 194
      ],
      reroll: false,
    },
    {
      rate: 30,
      units: [
       '超越科学者ヘヴン博士',  // 481
      ],
      reroll: false,
    },
  ],

};

