import { GatyaSet } from "@/data/gatyasets";

export const Set939: GatyaSet = {
  name: "バスターズ祭",
  guaranteed: -1,
  shortName: "939",
  gatyasetId: 939,
  rateCumSum: [0, 7000, 9500, 10000],
  pools: [
    {
      rate: 0,
      units: [],
      reroll: false,
    },
    {
      rate: 7000,
      units: [
       'ネコ武闘家',            // 523
       'ネコマタドール',        // 495
       'ネコ探査機',            // 376
       'ネコボクサー',          // 325
       'ネコバサミ',            // 308
       'ねこ陰陽師',            // 198
       'サイキックネコ',        // 197
       'ねこ人魚',              // 149
       'ねこロッカー',          // 148
       'ブリキネコ',            // 147
       'たけうまねこ',          // 146
       'ねこガンマン',          // 145
       'ネコ魔剣士',            //  58
       'ネコアーチャー',        //  56
       'ネコ魔女',              //  55
       'ネコシャーマン',        //  52
       'ねこ占い師',            //  51
       'ねこ僧侶',              //  50
       'ねこ泥棒',              //  49
       'ねこ海賊',              //  48
       'ねこファイター',        //  47
       'ねこジュラ',            //  46
       'ネコエステ',            //  41
       'ネコ車輪',              //  38
       'ネコホッピング',        //  37
      ],
      reroll: true,
    },
    {
      rate: 2500,
      units: [
       '金ネコ',                // 129
       'ねねこ',                // 131
       'にゃんこ城Mini',        // 144
       'メタルネコ',            // 200
       'おかめはちもくネコ',    // 237
       'ボンボンネコ',          // 238
       '見習いスニャイパー',    // 239
       '泉のネコ女神',          // 522
       'ネコフェンシング',      // 377
       'ネコジャンパー',        // 307
       'ネコサーファー',        // 199
       'ネコトースター',        // 153
       'ネコスケート',          // 152
       'ネコバーベル',          // 151
       '窓辺の乙女ネコ',        // 150
       'ねこ寿司',              //  61
       'ネコバスたぶ',          //  40
       'ネコリンゴ',            //  39
       'ネコスイマー',          //  36
       'オタネコ',              //  35
       'ねこタツ',              //  33
       'ネコザイル',            //  32
       'ネコ番長',              //  31
       'ネコぼさつ',            //  30
      ],
      reroll: false,
    },
    {
      rate: 500,
      units: [
       'ねこベビー',             //  59
       '風神のウィンディ',       //  75
       '地龍ソドム',             //  83
       '聖龍メギドラ',           //  84
       '召し豚のカイ',           // 106
       '宝杖のカッパーマイン',   // 107
       'ツルの恩返し',           // 135
       'ねこナース',             // 143
       'キャットマンダディ',     // 196
       '閃雷機兵レイ',           // 286
       'ネコマシン',             //  43
       '前田慶次',               //  72
       'アキラ',                 // 194
       'トゲルガ',               // 240
       '守護神アヌビス',         // 258
       'ノビルガ',               // 436
       'ラスヴォース',           // 519
       '地獄警官エマ',           // 559
       'ネコアイス',             //  42
       '雷神のサンディア',       //  76
       '神龍かむくら',           //  86
       '竜戦機ライデン',         //  87
       '猿帝のクウ',             // 105
       '伊達政宗',               // 124
       'ももたろう',             // 136
       'ホワイトラビット',       // 212
       '猫飯拳パイパイ',         // 283
       '古代軍船ガレーズ',       // 305
       'マッドシューター・サキ', // 533
       '邪龍ヘヴィジャーク',     // 620
       'ネコシュバリエ',         //  57
       'かぐやひめ',             // 138
       'テコルガ',               // 170
       '天誅ハヤブサ',           // 261
       '海王神ポセイドン',       // 316
       'ゾンビ娘ヴェルヴェーヌ', // 358
       '風隼さくら',             // 397
       '建築兵団スフィンクス',   // 715
       '狩猟娘テルン',           // 647
       '服部半蔵',               // 649
       '氷の精霊フリズ',         // 655
       '海龍ダライアサン',       // 660
       'ネコ天狗',               // 668
       '周遊芸団カルーセルズ',   // 674
       '女神ベガ',               // 682
       '光の女神シリウス',       // 686
      ],
      reroll: false,
    },
  ],

};

